@morgante 

I have one more question, related to the ref version bump from 6.0.0 to 9.1.0:


```Terraform will perform the following actions:

  # module.project.module.project-factory.null_resource.shared_vpc_subnet_invalid_name[0] will be destroyed
  - resource "null_resource" "shared_vpc_subnet_invalid_name" {
      - id       = "13870070129642255" -> null
      - triggers = {
          - "name" = ""
        } -> null
    }

  # module.project.module.project-factory.module.gcloud_delete.random_id.cache[0] will be created
  + resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project.module.project-factory.module.gcloud_deprivilege.random_id.cache[0] will be created
  + resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project.module.project-factory.module.gcloud_disable.random_id.cache[0] will be created
  + resource "random_id" "cache" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

I would like some help understanding what these changes are about and whether or not the destroy on `module.project.module.project-factory.null_resource.shared_vpc_subnet_invalid_name[0]` is safe?